{
    "class_name": "Functional",
    "config": {
        "name": "model_1",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        144,
                        144,
                        144,
                        1
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_1",
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_1",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 16,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_1",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_1",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_1",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_2",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_2",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 16,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_2",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_2",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_2",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "SpatialDropout3D",
                "config": {
                    "name": "spatial_dropout3d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "spatial_dropout3d_1",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_3",
                "inbound_nodes": [
                    [
                        [
                            "spatial_dropout3d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_3",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 16,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_3",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_3",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_3",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_1",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "leaky_re_lu_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2,
                        2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_4",
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_4",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 32,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_4",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_4",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_4",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_5",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_5",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_5",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 32,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_5",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_5",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_5",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "SpatialDropout3D",
                "config": {
                    "name": "spatial_dropout3d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "spatial_dropout3d_2",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_6",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_6",
                "inbound_nodes": [
                    [
                        [
                            "spatial_dropout3d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_6",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 32,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_6",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_6",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_6",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_2",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_2",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_4",
                            0,
                            0,
                            {}
                        ],
                        [
                            "leaky_re_lu_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_7",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2,
                        2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_7",
                "inbound_nodes": [
                    [
                        [
                            "add_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_7",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 64,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_7",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_7",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_7",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_8",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_8",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_8",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 64,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_8",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_8",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_8",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "SpatialDropout3D",
                "config": {
                    "name": "spatial_dropout3d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "spatial_dropout3d_3",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_9",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_9",
                "inbound_nodes": [
                    [
                        [
                            "spatial_dropout3d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_9",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 64,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_9",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_9",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_9",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_3",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_3",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_7",
                            0,
                            0,
                            {}
                        ],
                        [
                            "leaky_re_lu_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_10",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2,
                        2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_10",
                "inbound_nodes": [
                    [
                        [
                            "add_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_10",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 128,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_10",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_10",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_10",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_11",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_11",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addons>InstanceNormalization",
                "config": {
                    "name": "instance_normalization_11",
                    "trainable": true,
                    "dtype": "float32",
                    "groups": 128,
                    "axis": -1,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "instance_normalization_11",
                "inbound_nodes": [
                    [
                        [
                            "conv3d_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LeakyReLU",
                "config": {
                    "name": "leaky_re_lu_11",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                },
                "name": "leaky_re_lu_11",
                "inbound_nodes": [
                    [
                        [
                            "instance_normalization_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "SpatialDropout3D",
                "config": {
                    "name": "spatial_dropout3d_4",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.3,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "spatial_dropout3d_4",
                "inbound_nodes": [
                    [
                        [
                            "leaky_re_lu_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv3D",
                "config": {
                    "name": "conv3d_12",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv3d_12",
                "inbound_nodes": [
                    [
                        [
                            "spatial_dropout3d_4",
